"""
Файл содержит различные сообщения
"""


# Сообщение для выбора из меню
MESSAGE_INPUT_MENU = 'Выберите пункт из меню: '
# Пользователь выбрал пункт не из меню
MESSAGE_INCORRECT_INPUT_MENU = 'Выбранный пункт отсутствует в меню. Пожалуйста, выберите пункт из меню: '
# От пользователя требуется ввести целое не отрицательное значение
MESSAGE_INPUT_UNSIGNED_INT_VALUE = 'Введите целое неотрицательное значение: '
# Сообщение для выхода из ввода
MESSAGE_EXIT_INPUT = 'Выход'
# От пользователя требуется ввести город для фильтрации объявлений
MESSAGE_INPUT_CITY = f'Введите город (для выхода напишите "{MESSAGE_EXIT_INPUT}"): '
# Пользователь ввел город, который отсутствует в списке
MESSAGE_INCORRECT_INPUT_CITY = f'Вы ввели неверный город. Введите город (для выхода напишите "{MESSAGE_EXIT_INPUT}"): '
# От пользователя требуется ввести марку автомобиля для фильтрации объявлений
MESSAGE_INPUT_MARQUE = f'Введите марку автомобиля (для выхода напишите "{MESSAGE_EXIT_INPUT}"): '
# Пользователь ввел город, который отсутствует в списке
MESSAGE_INCORRECT_INPUT_MARQUE = f'Вы ввели неверную марку. Введите марку автомобиля (для выхода напишите' \
                                 f' "{MESSAGE_EXIT_INPUT}"): '
# От пользователя требуется ввести модель автомобиля для фильтрации объявлений
MESSAGE_INPUT_MODEL = f'Введите модель автомобиля (для выхода напишите "{MESSAGE_EXIT_INPUT}"): '
# Пользователь ввел город, который отсутствует в списке
MESSAGE_INCORRECT_INPUT_MODEL = f'Вы ввели неверную модель. Введите модель автомобиля (для выхода напишите' \
                                f' "{MESSAGE_EXIT_INPUT}"): '
